[
    {
        "movie": "The Matrix",
        "fact": "The iconic 'bullet time' effect was created using a rig of 120 individual cameras to freeze and rotate around the action."
    },
    {
        "movie": "Titanic",
        "fact": "James Cameron drew all of Jack’s sketches in the film himself — including the famous drawing of Rose."
    },
    {
        "movie": "The Dark Knight",
        "fact": "Heath Ledger directed the Joker’s homemade hostage videos himself with minimal direction from Christopher Nolan."
    },
    {
        "movie": "Pulp Fiction",
        "fact": "The briefcase contents are never revealed, sparking decades of fan theories."
    },
    {
        "movie": "Inception",
        "fact": "The rotating hallway fight scene was filmed using a giant spinning hallway set — no CGI."
    },
    {
        "movie": "Forrest Gump",
        "fact": "Tom Hanks didn’t take a salary for the film — he instead took a percentage of profits, earning over $60 million."
    },
    {
        "movie": "Interstellar",
        "fact": "Physicist Kip Thorne helped design the black hole so accurately that it led to scientific publications."
    },
    {
        "movie": "The Lion King",
        "fact": "The wildebeest stampede took animators over 2 years to animate."
    },
    {
        "movie": "The Godfather",
        "fact": "The cat Marlon Brando holds in the opening scene was a stray found on set."
    },
    {
        "movie": "Jurassic Park",
        "fact": "The T-Rex roar is a mix of dog, penguin, tiger, alligator, and baby elephant sounds."
    },
    {
        "movie": "Gladiator",
        "fact": "Oliver Reed died during filming, and some scenes were completed using CGI and body doubles."
    },
    {
        "movie": "The Shawshank Redemption",
        "fact": "The maggot fed to the crow was approved by the American Humane Association only after confirming it was dead."
    },
    {
        "movie": "Fight Club",
        "fact": "There’s a Starbucks cup hidden in nearly every scene of the film."
    },
    {
        "movie": "Harry Potter Series",
        "fact": "Daniel Radcliffe went through 160 pairs of glasses during the filming of all 8 movies."
    },
    {
        "movie": "Star Wars: The Empire Strikes Back",
        "fact": "The 'I am your father' twist was kept so secret that even most of the cast didn’t know until the premiere."
    },
    {
        "movie": "Frozen",
        "fact": "‘Let It Go’ was written in one day and completely changed the story’s direction afterward."
    },
    {
        "movie": "The Revenant",
        "fact": "Leonardo DiCaprio really ate raw bison liver for authenticity — despite being a vegetarian."
    },
    {
        "movie": "Back to the Future",
        "fact": "The time machine was originally a refrigerator, but was changed to a DeLorean to avoid kids locking themselves inside fridges."
    },
    {
        "movie": "3 Idiots",
        "fact": "The baby delivery scene was shot using a real engineering college's equipment and was supervised by actual medical experts."
    },
    {
        "movie": "Sholay",
        "fact": "Amjad Khan almost lost the role of Gabbar Singh because his voice was initially thought to be too soft."
    },
    {
        "movie": "Dilwale Dulhania Le Jayenge",
        "fact": "The film has been running in Mumbai’s Maratha Mandir cinema for over 25 years — a world record for any film in a single theatre."
    },
    {
        "movie": "Lagaan",
        "fact": "Lagaan was shot in Bhuj, Gujarat, in peak summer with temperatures going above 45°C. Most actors wore traditional attire without footwear."
    },
    {
        "movie": "Bahubali: The Beginning",
        "fact": "The waterfall in the movie is CGI, and it took 1 year of VFX work to perfect the opening scene."
    },
    {
        "movie": "PK",
        "fact": "Aamir Khan wore clothes picked from real people on the streets to reflect his alien character’s randomness."
    },
    {
        "movie": "Swades",
        "fact": "The village shown in the movie actually received electricity after the film crew left — inspired by the film."
    },
    {
        "movie": "Dangal",
        "fact": "Aamir Khan gained and lost over 25 kg during the movie to portray both older and younger versions of Mahavir Phogat."
    },
    {
        "movie": "Rang De Basanti",
        "fact": "Real MiG aircraft and air force cadets were used in the flying scenes for authenticity."
    },
    {
        "movie": "Gully Boy",
        "fact": "Ranveer Singh wrote and performed his own raps in the movie, inspired by real Mumbai street rappers Divine and Naezy."
    },
    {
        "movie": "The Social Network",
        "fact": "Armie Hammer played both Winklevoss twins, with body doubles and face replacement used for many scenes."
    },
    {
        "movie": "The Silence of the Lambs",
        "fact": "Anthony Hopkins only appears on screen for 16 minutes but still won an Oscar for Best Actor."
    },
    {
        "movie": "Slumdog Millionaire",
        "fact": "The child actors were from real Mumbai slums and were later given trust funds and housing by the filmmakers."
    },
    {
        "movie": "Barfi!",
        "fact": "Ranbir Kapoor prepared for the role by studying Charlie Chaplin’s body language to perfect the silent expressions."
    },
    {
        "movie": "Andaz Apna Apna",
        "fact": "The movie was a flop during its initial release but gained cult status through TV reruns and word of mouth."
    },
    {
        "movie": "Drishyam",
        "fact": "Ajay Devgn's character uses classic techniques from real police procedurals to cover up the crime — all rooted in actual criminal cases."
    },
    {
        "movie": "The Pursuit of Happyness",
        "fact": "The real Chris Gardner makes a cameo at the end of the movie walking past Will Smith and his son."
    },
    {
        "movie": "The Truman Show",
        "fact": "After the movie's release, psychologists coined the term 'The Truman Show Delusion' for people believing their lives were being filmed."
    },
    {
        "movie": "Black Panther",
        "fact": "Wakanda's spoken language is based on real South African Xhosa, which John Kani (T'Chaka) taught the cast."
    }
]